eldarkg/emdr1986x-std-per-lib-doc/Keil.MDR1986BExx.pdsc
    <!-- Lib File -->
    <component Cclass="Drivers" Cgroup="LIB" Cversion="1.3.1" condition="CON_MDR1986Bxx">
      <description>LIB file for MDR1986BExx Series</description>
      <files>
        <file category="header" name="Libraries\MDR32F9Qx_StdPeriph_Driver\inc\MDR32F9Qx_lib.h"/>
      </files>
    </component>

    <!-- ADC Driver -->
    <component Cclass="Drivers" Cgroup="ADC" Cversion="1.3.1" condition="CON_MDR1986Bxx">
      <description>ADC driver for MDR1986BExx Series</description>
      <files>
        <file category="header" name="Libraries\MDR32F9Qx_StdPeriph_Driver\inc\MDR32F9Qx_adc.h"/>
        <file category="source" name="Libraries\MDR32F9Qx_StdPeriph_Driver\src\MDR32F9Qx_adc.c"/>
      </files>
    </component>

    <!-- BKP Driver -->
    <component Cclass="Drivers" Cgroup="BKP" Cversion="1.3.1" condition="CON_MDR1986Bxx">
      <description>BKP driver for MDR1986BExx Series</description>
      <files>
        <file category="header" name="Libraries\MDR32F9Qx_StdPeriph_Driver\inc\MDR32F9Qx_bkp.h"/>
        <file category="source" name="Libraries\MDR32F9Qx_StdPeriph_Driver\src\MDR32F9Qx_bkp.c"/>
      </files>
    </component>

    <!-- CAN Driver -->
    <component Cclass="Drivers" Cgroup="CAN" Cversion="1.3.1" condition="CON_MDR1986Bxx">
      <description>CAN driver for MDR1986BExx Series</description>
      <files>
        <file category="header" name="Libraries\MDR32F9Qx_StdPeriph_Driver\inc\MDR32F9Qx_can.h"/>
        <file category="source" name="Libraries\MDR32F9Qx_StdPeriph_Driver\src\MDR32F9Qx_can.c"/>
      </files>
    </component>

    <!-- COMP Driver -->
    <component Cclass="Drivers" Cgroup="COMP" Cversion="1.3.1" condition="CON_MDR1986BE9x">
      <description>COMP driver for MDR1986BE9x Series</description>
      <files>
        <file category="header" name="Libraries\MDR32F9Qx_StdPeriph_Driver\inc\MDR32F9Qx_comp.h"/>
        <file category="source" name="Libraries\MDR32F9Qx_StdPeriph_Driver\src\MDR32F9Qx_comp.c"/>
      </files>
    </component>

    <!-- DAC Driver -->
    <component Cclass="Drivers" Cgroup="DAC" Cversion="1.3.1" condition="CON_MDR1986Bxx">
      <description>DAC driver for MDR1986BExx Series</description>
      <files>
        <file category="header" name="Libraries\MDR32F9Qx_StdPeriph_Driver\inc\MDR32F9Qx_dac.h"/>
        <file category="source" name="Libraries\MDR32F9Qx_StdPeriph_Driver\src\MDR32F9Qx_dac.c"/>
      </files>
    </component>

    <!-- DMA Driver -->
    <component Cclass="Drivers" Cgroup="DMA" Cversion="1.3.1" condition="CON_MDR1986Bxx">
      <description>DMA driver for MDR1986BExx Series</description>
      <files>
        <file category="header" name="Libraries\MDR32F9Qx_StdPeriph_Driver\inc\MDR32F9Qx_dma.h"/>
        <file category="source" name="Libraries\MDR32F9Qx_StdPeriph_Driver\src\MDR32F9Qx_dma.c"/>
      </files>
    </component>

    <!-- EBC Driver -->
    <component Cclass="Drivers" Cgroup="EBC" Cversion="1.3.1" condition="CON_MDR1986Bxx">
      <description>EBC driver for MDR1986BExx Series</description>
      <files>
        <file category="header" name="Libraries\MDR32F9Qx_StdPeriph_Driver\inc\MDR32F9Qx_ebc.h"/>
        <file category="source" name="Libraries\MDR32F9Qx_StdPeriph_Driver\src\MDR32F9Qx_ebc.c"/>
      </files>
    </component>

    <!-- EEPROM Driver -->
    <component Cclass="Drivers" Cgroup="EEMPROM" Cversion="1.3.1" condition="CON_MDR1986Bxx">
      <description>EEPROM driver for MDR1986BExx Series</description>
      <files>
        <file category="header" name="Libraries\MDR32F9Qx_StdPeriph_Driver\inc\MDR32F9Qx_eeprom.h"/>
        <file category="source" name="Libraries\MDR32F9Qx_StdPeriph_Driver\src\MDR32F9Qx_eeprom.c"/>
      </files>
    </component>

    <!-- I2C Driver -->
    <component Cclass="Drivers" Cgroup="I2C" Cversion="1.3.1" condition="CON_MDR1986BE9x">
      <description>I2C driver for MDR1986BE9x Series</description>
      <files>
        <file category="header" name="Libraries\MDR32F9Qx_StdPeriph_Driver\inc\MDR32F9Qx_i2c.h"/>
        <file category="source" name="Libraries\MDR32F9Qx_StdPeriph_Driver\src\MDR32F9Qx_i2c.c"/>
      </files>
    </component>

    <!-- IWDG Driver -->
    <component Cclass="Drivers" Cgroup="IWDG" Cversion="1.3.1" condition="CON_MDR1986Bxx">
      <description>IWDG driver for MDR1986BExx Series</description>
      <files>
        <file category="header" name="Libraries\MDR32F9Qx_StdPeriph_Driver\inc\MDR32F9Qx_iwdg.h"/>
        <file category="source" name="Libraries\MDR32F9Qx_StdPeriph_Driver\src\MDR32F9Qx_iwdg.c"/>
      </files>
    </component>

    <!-- PORT Driver -->
    <component Cclass="Drivers" Cgroup="PORT" Cversion="1.3.1" condition="CON_MDR1986Bxx">
      <description>PORT driver for MDR1986BExx Series</description>
      <files>
        <file category="header" name="Libraries\MDR32F9Qx_StdPeriph_Driver\inc\MDR32F9Qx_port.h"/>
        <file category="source" name="Libraries\MDR32F9Qx_StdPeriph_Driver\src\MDR32F9Qx_port.c"/>
      </files>
    </component>

    <!-- POWER Driver -->
    <component Cclass="Drivers" Cgroup="POWER" Cversion="1.3.1" condition="CON_MDR1986Bxx">
      <description>POWER driver for MDR1986BExx Series</description>
      <files>
        <file category="header" name="Libraries\MDR32F9Qx_StdPeriph_Driver\inc\MDR32F9Qx_power.h"/>
        <file category="source" name="Libraries\MDR32F9Qx_StdPeriph_Driver\src\MDR32F9Qx_power.c"/>
      </files>
    </component>

    <!-- RST_CLK Driver -->
    <component Cclass="Drivers" Cgroup="RST_CLK" Cversion="1.3.1" condition="CON_MDR1986Bxx">
      <description>RST_CLK driver for MDR1986BExx Series</description>
      <files>
        <file category="header" name="Libraries\MDR32F9Qx_StdPeriph_Driver\inc\MDR32F9Qx_rst_clk.h"/>
        <file category="source" name="Libraries\MDR32F9Qx_StdPeriph_Driver\src\MDR32F9Qx_rst_clk.c"/>
      </files>
    </component>

