eldarkg/emdr1986x-std-per-lib-doc/Keil.MDR1986BExx.pdsc
    <!-- SSP Driver -->
    <component Cclass="Drivers" Cgroup="SSP" Cversion="1.3.1" condition="CON_MDR1986Bxx">
      <description>SSP driver for MDR1986BExx Series</description>
      <files>
        <file category="header" name="Libraries\MDR32F9Qx_StdPeriph_Driver\inc\MDR32F9Qx_ssp.h"/>
        <file category="source" name="Libraries\MDR32F9Qx_StdPeriph_Driver\src\MDR32F9Qx_ssp.c"/>
      </files>
    </component>

    <!-- TIMER Driver -->
    <component Cclass="Drivers" Cgroup="TIMER" Cversion="1.3.1" condition="CON_MDR1986Bxx">
      <description>TIMER driver for MDR1986BExx Series</description>
      <files>
        <file category="header" name="Libraries\MDR32F9Qx_StdPeriph_Driver\inc\MDR32F9Qx_timer.h"/>
        <file category="source" name="Libraries\MDR32F9Qx_StdPeriph_Driver\src\MDR32F9Qx_timer.c"/>
      </files>
    </component>

    <!-- UART Driver -->
    <component Cclass="Drivers" Cgroup="UART" Cversion="1.3.1" condition="CON_MDR1986Bxx">
      <description>UART driver for MDR1986BExx Series</description>
      <files>
        <file category="header" name="Libraries\MDR32F9Qx_StdPeriph_Driver\inc\MDR32F9Qx_uart.h"/>
        <file category="source" name="Libraries\MDR32F9Qx_StdPeriph_Driver\src\MDR32F9Qx_uart.c"/>
      </files>
    </component>

    <!-- MIL_STD_1553 Driver -->
    <component Cclass="Drivers" Cgroup="MIL_STD_1553" Cversion="1.3.1" condition="CON_MDR1986BExT">
      <description>MIL_STD_1553 driver for MDR1986BE1T and MDR1986BE3T</description>
      <files>
        <file category="header" name="Libraries\MDR32F9Qx_StdPeriph_Driver\inc\MDR32F9Qx_mil_std_1553.h"/>
        <file category="source" name="Libraries\MDR32F9Qx_StdPeriph_Driver\src\MDR32F9Qx_mil_std_1553.c"/>
      </files>
    </component>

    <!-- ARINC429R Driver -->
    <component Cclass="Drivers" Cgroup="ARINC429R" Cversion="1.3.1" condition="CON_MDR1986BExT">
      <description>ARINC429R driver for MDR1986BE1T and MDR1986BE3T</description>
      <files>
        <file category="header" name="Libraries\MDR32F9Qx_StdPeriph_Driver\inc\MDR32F9Qx_arinc429r.h"/>
        <file category="source" name="Libraries\MDR32F9Qx_StdPeriph_Driver\src\MDR32F9Qx_arinc429r.c"/>
      </files>
    </component>

    <!-- ARINC429T  Driver -->
    <component Cclass="Drivers" Cgroup="ARINC429T" Cversion="1.3.1" condition="CON_MDR1986BExT">
      <description>ARINC429T driver for MDR1986BE1T and MDR1986BE3T</description>
      <files>
        <file category="header" name="Libraries\MDR32F9Qx_StdPeriph_Driver\inc\MDR32F9Qx_arinc429t.h"/>
        <file category="source" name="Libraries\MDR32F9Qx_StdPeriph_Driver\src\MDR32F9Qx_arinc429t.c"/>
      </files>
    </component>

    <!-- Audio  Driver -->
    <component Cclass="Drivers" Cgroup="Audio" Cversion="1.3.1" condition="CON_MDR1986BE3T">
      <description>Audio driver for MDR1986BE3T</description>
      <files>
        <file category="header" name="Libraries\MDR32F9Qx_StdPeriph_Driver\inc\MDR32F9Qx_audio.h"/>
        <file category="source" name="Libraries\MDR32F9Qx_StdPeriph_Driver\src\MDR32F9Qx_audio.c"/>
      </files>
    </component>

    <!-- Ethernet  Driver -->
    <component Cclass="Drivers" Cgroup="Ethernet" Cversion="1.3.1" condition="CON_MDR1986BExT">
      <description>Ethernet driver for MDR1986BE1T and MDR1986BE3T</description>
      <files>
        <file category="header" name="Libraries\MDR32F9Qx_StdPeriph_Driver\inc\MDR32F9Qx_eth.h"/>
        <file category="source" name="Libraries\MDR32F9Qx_StdPeriph_Driver\src\MDR32F9Qx_eth.c"/>
      </files>
    </component>

    <!-- LED Driver -->
    <component Cclass="Drivers" Cgroup="LED" Cversion="1.3.1" condition="CON_MDR1986BE3T">
      <description>LED driver for MDR1986BE3T</description>
      <files>
        <file category="header" name="Libraries\MDR32F9Qx_StdPeriph_Driver\inc\MDR32F9Qx_led.h"/>
        <file category="source" name="Libraries\MDR32F9Qx_StdPeriph_Driver\src\MDR32F9Qx_led.c"/>
      </files>
    </component>

    <!-- Keypad  Driver -->
    <component Cclass="Drivers" Cgroup="Keypad" Cversion="1.3.1" condition="CON_MDR1986BE3T">
      <description>Keypad driver for MDR1986BE3T</description>
      <files>
        <file category="header" name="Libraries\MDR32F9Qx_StdPeriph_Driver\inc\MDR32F9Qx_keypad.h"/>
        <file category="source" name="Libraries\MDR32F9Qx_StdPeriph_Driver\src\MDR32F9Qx_keypad.c"/>
      </files>
    </component>

    <!-- USB Driver -->
    <component Cclass="Drivers" Cgroup="USB" Cversion="1.3.1" condition="CON_MDR1986Bxx">
      <description>USB driver for MDR1986BExx Series</description>
      <files>
        <file category="header" name="Libraries\MDR32F9Qx_StdPeriph_Driver\inc\MDR32F9Qx_usb.h"/>
        <file category="source" name="Libraries\MDR32F9Qx_StdPeriph_Driver\src\MDR32F9Qx_usb.c"/>
      </files>
    </component>

    <!-- USB Library Driver -->
    <component Cclass="Drivers" Cgroup="USB Library" Cversion="1.3.1" condition="CON_MDR1986Bxx">
      <description>USB Library for MDR1986BE9x Series</description>
      <files>
        <file category="header" name="Libraries\MDR32F9Qx_StdPeriph_Driver\inc\USB_Library\MDR32F9Qx_usb_CDC.h"/>
        <file category="header" name="Libraries\MDR32F9Qx_StdPeriph_Driver\inc\USB_Library\MDR32F9Qx_usb_device.h"/>
        <file category="source" name="Libraries\MDR32F9Qx_StdPeriph_Driver\src\USB_Library\MDR32F9Qx_usb_CDC.c"/>
        <file category="source" name="Libraries\MDR32F9Qx_StdPeriph_Driver\src\USB_Library\MDR32F9Qx_usb_device.c"/>
      </files>
    </component>

    <!-- STD for 1986BE4 -->
    <!-- ADC Driver -->
    <component Cclass="Drivers" Cgroup="ADC" Cversion="1.3.1" condition="CON_MDR1986BE4">
      <description>ADC driver for MDR1986BE4</description>
      <files>
        <file category="header" name="Libraries\MDR1986BE4_StdPeriph_Driver\inc\MDR32F9Qx_ADC.h"/>
        <file category="source" name="Libraries\MDR1986BE4_StdPeriph_Driver\src\MDR32F9Qx_ADC.c"/>
      </files>
    </component>

    <!-- ADCIU Driver -->
    <component Cclass="Drivers" Cgroup="ADCIU" Cversion="1.3.1" condition="CON_MDR1986BE4">
      <description>ADCIU driver for MDR1986BE4</description>
      <files>
        <file category="header" name="Libraries\MDR1986BE4_StdPeriph_Driver\inc\MDR32F9Qx_adciu.h"/>
        <file category="source" name="Libraries\MDR1986BE4_StdPeriph_Driver\src\MDR32F9Qx_adciu.c"/>
      </files>
    </component>

    <!-- BKP  Driver -->
    <component Cclass="Drivers" Cgroup="BKP" Cversion="1.3.1" condition="CON_MDR1986BE4">
      <description>BKP driver for MDR1986BE4</description>
      <files>
        <file category="header" name="Libraries\MDR1986BE4_StdPeriph_Driver\inc\MDR32F9Qx_BKP.h"/>
        <file category="source" name="Libraries\MDR1986BE4_StdPeriph_Driver\src\MDR32F9Qx_BKP.c"/>
      </files>
    </component>

    <!-- COMP  Driver -->
    <component Cclass="Drivers" Cgroup="COMP" Cversion="1.3.1" condition="CON_MDR1986BE4">
      <description>COMP driver for MDR1986BE4</description>
      <files>
        <file category="header" name="Libraries\MDR1986BE4_StdPeriph_Driver\inc\MDR32F9Qx_comp.h"/>
        <file category="source" name="Libraries\MDR1986BE4_StdPeriph_Driver\src\MDR32F9Qx_comp.c"/>
      </files>
    </component>

    <!-- CRC  Driver -->
    <component Cclass="Drivers" Cgroup="CRC" Cversion="1.3.1" condition="CON_MDR1986BE4">
      <description>CRC driver for MDR1986BE4</description>
      <files>
        <file category="header" name="Libraries\MDR1986BE4_StdPeriph_Driver\inc\MDR32F9Qx_crc.h"/>
        <file category="source" name="Libraries\MDR1986BE4_StdPeriph_Driver\src\MDR32F9Qx_crc.c"/>
      </files>
    </component>

    <!-- DAC Driver -->
    <component Cclass="Drivers" Cgroup="DAC" Cversion="1.3.1" condition="CON_MDR1986BE4">
      <description>DAC driver for MDR1986BE4</description>
      <files>
        <file category="header" name="Libraries\MDR1986BE4_StdPeriph_Driver\inc\MDR32F9Qx_dac.h"/>
        <file category="source" name="Libraries\MDR1986BE4_StdPeriph_Driver\src\MDR32F9Qx_dac.c"/>
      </files>
    </component>

